Core/src/DataProcessors/РегистрацияКонтрагентов/РегистрацияКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РегистрацияКонтрагентов</name>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОблагаетсяНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислениеНДФЛ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрагентов</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныйОрган</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის  &quot;ფიზიკური პირები&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;კონტრაგენტები&quot;</description>
    </items>
    <items>
      <name>СправочникДоговорыКонтрагентов</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;კონტრაგენტის ხელშეკრულებები&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;მომხმარებლები&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;ორგანიზაციები&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;სავაჭრო წერტილები&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;საკონტაქტო პირები&quot;</description>
    </items>
    <items>
      <name>СправочникВидыДеятельностиЕНВД</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;საქმიანობის განხორციელების მისამართები&quot;</description>
    </items>
    <items>
      <name>СправочникСтруктурныеЕдиницы</name>
      <description>საკონტაქტო ინფორმაციები ცნობარისთვის &quot;სტრუქტურული ერთეულები&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресТолькоРоссийский</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛица</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокРолей</name>
    <comment>Для представления в списках</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpДатаРегистрацииСвязи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpФизлицо</name>
    <comment>Физическое лицо</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/DataProcessors/РегистрацияКонтрагентов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИзФормыВыбора") Тогда
		ИзФормыВыбора = Истина;
		Элементы.Сгенерировать.Заголовок = НСтр("ka='შექმნა და დოკუმენტში გადატანა';ru='Создать и Перенести в документ';en='Create and Move to the document'");
	КонецЕсли;
	СотрудникОтветственного = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПараметрыСеанса.ТекущийПользователь, "ОсновнойОтветственный");
	
	Элементы.НалогообложениеНДС.Видимость = НЕ ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов");
	
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	Если ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо") И ПустаяСтрока(Меил) Тогда
		//Сообщить("იურიდიული პირისთვის აუცილებელია ელ. ფოსტის მითითება!");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "იურიდიული პირისთვის აუცილებელია ელ. ფოსტის მითითება!";
		Сообщение.Поле =  "Меил";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Телефон) И НЕ СтрДлина(СокрЛП(Телефон)) = 9 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Некоректный номер телефона '; ka = 'არაკორექტული ტელეფონის ნომერი '") + Телефон;
		Сообщение.Поле =  "Телефон";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Меил) И (СтрДлина(Меил) = СтрДлина(СтрЗаменить(Меил, "@", "")) ИЛИ СтрДлина(Меил) > СтрДлина(СтрЗаменить(Меил, "@", ""))+1) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "კონტრაგენტის ელ. ფოსტა მითითებულია არასწორ ფორმატში " + Меил;
		Сообщение.Поле =  "Меил";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Меил2) И (СтрДлина(Меил2) = СтрДлина(СтрЗаменить(Меил2, "@", "")) ИЛИ СтрДлина(Меил2) > СтрДлина(СтрЗаменить(Меил2, "@", ""))+1) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "კონტრაგენტის ელ. ფოსტა 2 მითითებულია არასწორ ფორმატში " + Меил2;
		Сообщение.Поле =  "Меил2";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ФактическийАдрес) Тогда
		Ответ = Вопрос("ველი ""ფაქტიური მისამართი"" არ არის შევსებული. გაგრძელდეს ფორმირება?", РежимДиалогаВопрос.ОКОтмена);
		Если НЕ Ответ = КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	СгенерироватьНаСервере();
	Если ИзФормыВыбора И ЗначениеЗаполнено(СсылкаКонтрагента) Тогда
		Оповестить("СозданияКонтрагентаИзОбработки", СсылкаКонтрагента);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаСервере()

	НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН);
	Если ЗначениеЗаполнено(НайденныйКонтрагент) Тогда
		Сообщить("მოცემული საიდენტიფიკაციო კოდით უკვე არსებობს კონტრაგენტი " + Строка(НайденныйКонтрагент));
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();//
	
	//Создать контрагент без контактного лица, генерального директора, договора;
	НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовКонтрагент.Ответственный			= СотрудникОтветственного;
	НовКонтрагент.Родитель 				= Группа;
	
	НовКонтрагент.СчетУчетаАвансовПокупателя        = Группа.СчетУчетаАвансовПокупателя;
	НовКонтрагент.СчетУчетаАвансовПоставщику        = Группа.СчетУчетаАвансовПоставщику;
	НовКонтрагент.СчетУчетаРасчетовСПокупателем     = Группа.СчетУчетаРасчетовСПокупателем;
	НовКонтрагент.СчетУчетаРасчетовСПоставщиком     = Группа.СчетУчетаРасчетовСПоставщиком;
	НовКонтрагент.СчетУчетаАвансовПокупателяРегл    = Группа.СчетУчетаАвансовПокупателяРегл;
	НовКонтрагент.СчетУчетаАвансовПоставщикуРегл    = Группа.СчетУчетаАвансовПоставщикуРегл;
	НовКонтрагент.СчетУчетаРасчетовСПокупателемРегл = Группа.СчетУчетаРасчетовСПокупателемРегл;
	НовКонтрагент.СчетУчетаРасчетовСПоставщикомРегл = Группа.СчетУчетаРасчетовСПоставщикомРегл;
				  
	НовКонтрагент.Наименование			= Контрагент;
	НовКонтрагент.НаименованиеПолное	= НаименованиеПолное;
	НовКонтрагент.ИНН 					= ИНН;
	НовКонтрагент.ВидКонтрагента		= ЮрФизЛицо;
	
	НовКонтрагент.ДатаСоздания = ТекущаяДата();
	
	
	НовКонтрагент.Покупатель      = Покупатель;
	НовКонтрагент.Поставщик       = Поставщик;
	НовКонтрагент.ПрочиеОтношения = ПрочиеОтношения;
	
    НовКонтрагент.НалогообложениеНДС    = НалогообложениеНДС;	
	
	НовКонтрагент.ВестиРасчетыПоДоговорам 	= Истина;
	НовКонтрагент.ВестиРасчетыПоДокументам 	= Истина;
	НовКонтрагент.ВестиРасчетыПоЗаказам 	= Истина;
	НовКонтрагент.ВестиУчетОплатыПоСчетам 	= Истина;	
	
	Если ЗначениеЗаполнено(Группа) Тогда
		Если ЗначениеЗаполнено(Группа.СчетУчетаРасчетовСПокупателем) Тогда
			НовКонтрагент.СчетУчетаРасчетовСПокупателем = Группа.СчетУчетаРасчетовСПокупателем;
		Иначе
			НовКонтрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		КонецЕсли;
		Если ЗначениеЗаполнено(Группа.СчетУчетаАвансовПокупателя) Тогда
			НовКонтрагент.СчетУчетаАвансовПокупателя = Группа.СчетУчетаАвансовПокупателя;
		Иначе
			НовКонтрагент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
		КонецЕсли;
		Если ЗначениеЗаполнено(Группа.СчетУчетаРасчетовСПоставщиком) Тогда
			НовКонтрагент.СчетУчетаРасчетовСПоставщиком = Группа.СчетУчетаРасчетовСПоставщиком;
		Иначе
			НовКонтрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		КонецЕсли;
		Если ЗначениеЗаполнено(Группа.СчетУчетаАвансовПоставщику) Тогда
			НовКонтрагент.СчетУчетаАвансовПоставщику = Группа.СчетУчетаАвансовПоставщику;
		Иначе
			НовКонтрагент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
		КонецЕсли;
	Иначе
		НовКонтрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		НовКонтрагент.СчетУчетаАвансовПокупателя 	= ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
		НовКонтрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
		НовКонтрагент.СчетУчетаАвансовПоставщику 	= ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;		
	КонецЕсли;

	
	Если НЕ ПустаяСтрока(ЮридическийАдрес) Тогда
		СтрЮрАдрес = НовКонтрагент.КонтактнаяИнформация.Добавить();
		СтрЮрАдрес.Тип 				= Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрЮрАдрес.Вид 				= Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		СтрЮрАдрес.Представление 	= ЮридическийАдрес;
	КонецЕсли;
	Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
		СтрЮрАдрес = НовКонтрагент.КонтактнаяИнформация.Добавить();
		СтрЮрАдрес.Тип 				= Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтрЮрАдрес.Вид 				= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		СтрЮрАдрес.Представление 	= ФактическийАдрес;
	КонецЕсли;
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();
	ЗаполнитьЗначенияСвойств(НовКонтрагент, СчетаУчета);
		
	
	Попытка
		//НовКонтрагент.ОбменДанными.Загрузка = Истина;
		НовКонтрагент.ДополнительныеСвойства.Вставить("ИзОбработкиСозданияКонтрагентов", Истина);
		НовКонтрагент.Записать();
		СсылкаКонтрагента = НовКонтрагент.Ссылка;
		СтрСозданныеСправочники = СозданныеСправочники.Добавить();
		СтрСозданныеСправочники.ИмяОбъекта = "კონტრაგენტი";
		СтрСозданныеСправочники.Справочник = СсылкаКонтрагента;
	Исключение
		СозданныеСправочники.Очистить();
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();//
		Возврат;
	КонецПопытки;
	//////////////////////////////////////////////////////////////////////////////////////////
	
	//Контактное лицо
	НовКонтактноеЛицо = Справочники.КонтактныеЛица.СоздатьЭлемент();
	НовКонтактноеЛицо.Наименование 	= КонтактноеЛицо;
	НовКонтактноеЛицо.Владелец 		= СсылкаКонтрагента;
	Если НЕ ПустаяСтрока(Телефон) Тогда
		СтрКонтИнф = НовКонтактноеЛицо.КонтактнаяИнформация.Добавить();
		СтрКонтИнф.Тип 				= Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтрКонтИнф.Вид 				= Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;//ტელეფონი
		СтрКонтИнф.Представление 	= Телефон;
		СтрКонтИнф.НомерТелефона 	= СтрЗаменить(Телефон, " ", "");
		СтрКонтИнф.ЗначенияПолей	= Телефон;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Телефон2) Тогда
		ВидТелефон2 = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("ტელეფონი 2", , Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);
		Если ЗначениеЗаполнено(ВидТелефон2) Тогда
			СтрКонтИнф = НовКонтактноеЛицо.КонтактнаяИнформация.Добавить();
			СтрКонтИнф.Тип 				= Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрКонтИнф.Вид 				= ВидТелефон2;
			СтрКонтИнф.Представление 	= Телефон2;
			СтрКонтИнф.НомерТелефона 	= СтрЗаменить(Телефон2, " ", "");
			СтрКонтИнф.ЗначенияПолей	= Телефон2;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Телефон3) Тогда
		ВидТелефон3 = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("ტელეფონი 3", , Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);
		Если ЗначениеЗаполнено(ВидТелефон3) Тогда
			СтрКонтИнф = НовКонтактноеЛицо.КонтактнаяИнформация.Добавить();
			СтрКонтИнф.Тип 				= Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрКонтИнф.Вид 				= ВидТелефон3;
			СтрКонтИнф.Представление 	= Телефон3;
			СтрКонтИнф.НомерТелефона 	= СтрЗаменить(Телефон3, " ", "");
			СтрКонтИнф.ЗначенияПолей	= Телефон3;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Меил) Тогда
		СтрКонтИнф = НовКонтактноеЛицо.КонтактнаяИнформация.Добавить();
		СтрКонтИнф.Тип 				= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрКонтИнф.Вид 				= Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;//ელ ფოსტა
		СтрКонтИнф.Представление 	= Меил;
		СтрКонтИнф.АдресЭП 			= Меил;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Меил2) Тогда
		ВидМеила2 = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("ელ. ფოსტა 2", , Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛица);
		Если ЗначениеЗаполнено(ВидМеила2) Тогда
			СтрКонтИнф = НовКонтактноеЛицо.КонтактнаяИнформация.Добавить();
			СтрКонтИнф.Тип 				= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтрКонтИнф.Вид 				= ВидМеила2;
			СтрКонтИнф.Представление 	= Меил2;
			СтрКонтИнф.АдресЭП 			= Меил2;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		НовКонтактноеЛицо.Записать();
		СсылкаКонтактноеЛицо = НовКонтактноеЛицо.Ссылка;
		СтрСозданныеСправочники = СозданныеСправочники.Добавить();
		СтрСозданныеСправочники.ИмяОбъекта = "საკონტაქტო პირი";
		СтрСозданныеСправочники.Справочник = СсылкаКонтактноеЛицо;
	Исключение
		СозданныеСправочники.Очистить();
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();//
		Возврат;
	КонецПопытки;
	//////////////////////////////////////////////////////////////////////////////////////////
	
	
	
	
	//Заполнить КонтактноеЛицо, ГенеральныйДиректор, ОсновнойДоговор
	КонтрагентОбъект = СсылкаКонтрагента.ПолучитьОбъект();
	КонтрагентОбъект.КонтактноеЛицо 		= СсылкаКонтактноеЛицо;
	Если ЗначениеЗаполнено(Телефон) Тогда
		СтрКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		СтрКИ.Тип 				= Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтрКИ.Вид 				= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;//ტელეფონი
		СтрКИ.Представление 	= Телефон;
		СтрКИ.НомерТелефона 	= СтрЗаменить(Телефон, " ", "");
		СтрКИ.ЗначенияПолей		= Телефон;
	КонецЕсли;
	Если ЗначениеЗаполнено(Меил) Тогда
		СтрКИ = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
		СтрКИ.Тип 				= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрКИ.Вид 				= Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;//ელ ფოსტა
		СтрКИ.Представление 	= Меил;
		СтрКИ.АдресЭП 			= Меил;
	КонецЕсли;
	
	пСрокОплатыПоставщику 	= Константы.СрокОплатыПоставщику.Получить();
	пСрокОплатыПокупателя	= Константы.СрокОплатыПокупателя.Получить();
	пВалютаРасчетов			= Константы.НациональнаяВалюта.Получить();
	пВидЦен					= Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
	пОрганизация			= Справочники.Организации.ОсновнаяОрганизация;
	
	НовыйДоговор = КонтрагентОбъект.ДоговорПоУмолчанию.ПолучитьОбъект();
	НовыйДоговор.Наименование			= НСТР("ka='ძირითადი ხელშეკრულება';ru='Основной договор';en='main contract'");
	НовыйДоговор.ВалютаРасчетов			= пВалютаРасчетов;
	НовыйДоговор.Организация			= пОрганизация;
	НовыйДоговор.ВидДоговора			= Перечисления.ВидыДоговоров.СПокупателем;
	НовыйДоговор.ВидЦен					= пВидЦен;
	НовыйДоговор.Владелец				= СсылкаКонтрагента;
	НовыйДоговор.СрокОплатыПоставщику 	= пСрокОплатыПоставщику;
	НовыйДоговор.СрокОплатыПокупателя 	= пСрокОплатыПокупателя;	
	//НовыйДоговор.НалогообложениеНДС    	= Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	НовыйДоговор.Адрес 					= ФактическийАдрес;
	
	Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
		НоваяСтрокаТЧ = НовыйДоговор.КонтактнаяИнформация.Добавить();
		НоваяСтрокаТЧ.Вид 			= Справочники.ВидыКонтактнойИнформации.АдресДоговорыКонтрагентов;
		НоваяСтрокаТЧ.Тип 			= Перечисления.ТипыКонтактнойИнформации.Адрес;
		НоваяСтрокаТЧ.Представление = ФактическийАдрес;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Телефон) Тогда
		НоваяСтрокаТЧ = НовыйДоговор.КонтактнаяИнформация.Добавить();
		НоваяСтрокаТЧ.Вид 			= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
		НоваяСтрокаТЧ.Тип 			= Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяСтрокаТЧ.Представление = Телефон;
		НоваяСтрокаТЧ.НомерТелефона = СтрЗаменить(Телефон, " ", "");
		НоваяСтрокаТЧ.ЗначенияПолей	= Телефон;
		НовыйДоговор.Телефон = Телефон;
	КонецЕсли;
	
	
	Попытка
		//НовыйДоговор.ОбменДанными.Загрузка = Истина;
		НовыйДоговор.Записать();
		СсылкаДоговора = НовыйДоговор.Ссылка;
		СтрСозданныеСправочники = СозданныеСправочники.Добавить();
		СтрСозданныеСправочники.ИмяОбъекта = "ხელშეკრულება";
		СтрСозданныеСправочники.Справочник = СсылкаДоговора;
		ОсновнойДоговор = СсылкаДоговора;
	Исключение
		СозданныеСправочники.Очистить();
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();//
		Возврат;
	КонецПопытки;
	
	НовКонтрагент.ДоговорПоУмолчанию 	= ОсновнойДоговор;
	
	Попытка
		КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
		КонтрагентОбъект.Записать();
	Исключение
		СозданныеСправочники.Очистить();
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();//
		Возврат;
	КонецПопытки;
	//////////////////////////////////////////////////////////////////////////////////////////
	
	ЗафиксироватьТранзакцию();//

КонецПроцедуры

&НаКлиенте
Процедура ДоговорыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Договоры.ТекущиеДанные.Адрес 	= ФактическийАдрес;
		Элементы.Договоры.ТекущиеДанные.Договор = ФактическийАдрес;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	Если ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо") Тогда
		КонтактноеЛицо = Контрагент;
	КонецЕсли;
	
	пЮрЛицо = (ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо"));
	Элементы.Меил.ОтметкаНезаполненного		= пЮрЛицо И НЕ ЗначениеЗаполнено(Меил);
	Элементы.Меил.АвтоОтметкаНезаполненного = пЮрЛицо И НЕ ЗначениеЗаполнено(Меил);	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо") Тогда
		КонтактноеЛицо = Контрагент;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	//Оповестить("СозданияКонтрагентаИзОбработки", СсылкаКонтрагента);
КонецПроцедуры


&НаКлиенте
Процедура МеилПриИзменении(Элемент)
	пЮрЛицо = (ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо"));
	Элементы.Меил.ОтметкаНезаполненного		= пЮрЛицо И НЕ ЗначениеЗаполнено(Меил);
	Элементы.Меил.АвтоОтметкаНезаполненного = пЮрЛицо И НЕ ЗначениеЗаполнено(Меил);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнфоИзRS(Команда)
	
	Если Не ЗначениеЗаполнено(ИНН) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='ს.კ / პ.ნ არ არის შევსებული';ru='ИНН не заполнено.';en='VAT is not filled.'"));
		Возврат;
	КонецЕсли;
	
	ПолучитьИнфоИзRSСервер()
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИнфоИзRSСервер()
	
	ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервере(ИНН);
	
	Если ДанныеКонтрагента = Неопределено Или ДанныеКонтрагента.Статус = ""  Тогда
		Сообщить(НСтр("ka='კონტრაგენტი მიმდინარე გსნ-თ ვერ მოიძებნა RS-ზე';ru='Контрагент с данным ИНН не найден на RS.';en='Counterparty with the INN is not found in the RS.'"));
		Возврат;
	КонецЕсли;	
	
	НаименованиеПолное = ДанныеКонтрагента.Имя;
	
	Контрагент = НаименованиеПолное;
	
	Если ДанныеКонтрагента.ТипОрганизаций = "ფიზიკური პირი" Тогда
		ЮрФизЛицо = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
		КонтактноеЛицо = Контрагент; 
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "შ\პ\ს" ИЛИ "სააქციო საზოგადოება" ИЛИ "საჯარო სამართლის იურიდიული პირი" Тогда	
		ЮрФизЛицо = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "სახელმწიფო ორგანოები" Тогда	
		ЮрФизЛицо = Перечисления.ВидыКонтрагентов.ГосударственныйОрган;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	ИначеЕсли ДанныеКонтрагента.ТипОрганизаций = "ინდივიდუალური მეწარმე" Тогда	
		ЮрФизЛицо = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	Иначе
		ЮрФизЛицо = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	КонецЕсли;	
			
	// Юридический адрес	
	ЮридическийАдрес = ДанныеКонтрагента.Адрес;
	ФактическийАдрес = ДанныеКонтрагента.Адрес;
	
	ДанныеКонтрагента = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьИнфоИзRSНаСервереНов(ИНН);
	
	Если ДанныеКонтрагента = Неопределено Или ДанныеКонтрагента.UnID = 0  Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДанныеКонтрагента.IsVatPayer Тогда
		ОблагаетсяНДС = Истина; 		
	Иначе 
		ОблагаетсяНДС = Ложь;
	КонецЕсли;
	
КонецПроцедуры
